---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.DocumentClosingEventArgs
source: html/6ed32bb3-4a8d-0b02-8c96-4afb1cb76b31.htm
---
# DocumentClosingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.